---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFC.PopExportState
source: html/719e062b-eea9-3010-33ad-e48dae367276.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFC.PopExportState Method

Resets the internal state of the exporter to process the previously active input element (if any), or
 the default state if the stack is empty.

## Syntax (C#)
```csharp
public void PopExportState()
```